Revit 2027 API
ThermalAsset.TransmitsLight Property
 A boolean flag that indicates whether or not the asset transmits light.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool TransmitsLight { get; set; }
Public Property TransmitsLight As Boolean
	Get
	Set
public:
property bool TransmitsLight {
	bool get ();
	void set (bool value);
}
member TransmitsLight : bool with get, set
Property Value
Boolean
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace